solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/edgefast_bluetooth/source/shell/fsl_shell.c
#if (defined(SHELL_USE_COMMON_TASK) && (SHELL_USE_COMMON_TASK > 0U))
#else
        do
        {
            if (KOSA_StatusSuccess == OSA_SemaphoreWait((osa_semaphore_handle_t)shellContextHandle->semphore, osaWaitForever_c))
            {
#endif

#endif

#endif
        {
            shellContextHandle->notificationPost = 0;
            do
            {
                if (1 == shellContextHandle->state.exit)
                {
                    if (shellContextHandle->serialReadHandle != NULL)
                    {
                        (void)SerialManager_CloseReadHandle(shellContextHandle->serialReadHandle);
                        shellContextHandle->serialReadHandle = NULL;
                    }
                    if (shellContextHandle->serialWriteHandle != NULL)
                    {
                        (void)SerialManager_CloseWriteHandle(shellContextHandle->serialWriteHandle);
                        shellContextHandle->serialWriteHandle = NULL;
                    }
                    break;
                }
                if (kStatus_SHELL_Success != (shell_status_t)SHELL_GetChar(shellContextHandle, &ch))
                {
                    /* If error occurred when getting a char, exit the task and waiting the new data arriving. */
                    break;
                }

                /* Special key */
                if (ch == KEY_ESC)
                {
                    shellContextHandle->stat = kSHELL_Special;
                    continue;
                }
                else if (shellContextHandle->stat == kSHELL_Special)
                {
                    /* Function key */
                    if ((char)ch == '[')
                    {
                        shellContextHandle->stat = kSHELL_Function;
                        continue;
                    }
                    shellContextHandle->stat = kSHELL_Normal;
                }
                else if (shellContextHandle->stat == kSHELL_Function)
                {
                    shellContextHandle->stat = kSHELL_Normal;

                    switch ((uint8_t)ch)
                    {
                        /* History operation here */
                        case 'A': /* Up key */
                            SHELL_GetHistoryCommand(shellContextHandle, (uint16_t)shellContextHandle->hist_current);
                            if (shellContextHandle->hist_current < (shellContextHandle->hist_count - 1U))
                            {
                                shellContextHandle->hist_current++;
                            }
                            break;
                        case 'B': /* Down key */
                            SHELL_GetHistoryCommand(shellContextHandle, (uint16_t)shellContextHandle->hist_current);
                            if (shellContextHandle->hist_current > 0U)
                            {
                                shellContextHandle->hist_current--;
                            }
                            break;
                        case 'D': /* Left key */
                            if ((bool)shellContextHandle->c_pos)
                            {
#if (SHELL_ECHO > 0)
                                if (0 == shellContextHandle->state.noEcho)
                                {
                                    (void)SHELL_Write(shellContextHandle, (char *)"\b", 1);
                                }
#endif
                                shellContextHandle->c_pos--;
                            }
                            break;
                        case 'C': /* Right key */
                            if (shellContextHandle->c_pos < shellContextHandle->l_pos)
                            {
#if (SHELL_ECHO > 0)
                                if (0 == shellContextHandle->state.noEcho)
                                {
                                    (void)SHELL_Write(shellContextHandle,
                                                      &shellContextHandle->line[shellContextHandle->c_pos], 1);
                                }
#endif
                                shellContextHandle->c_pos++;
                            }
                            break;
                        default:
                            break;
                    }
                    continue;
                }
                /* Handle tab key */
                else if ((char)ch == '\t')
                {
#if SHELL_AUTO_COMPLETE
                    /* Move the cursor to the beginning of line */
                    int i;
                    for (i = 0; i < shellContextHandle->c_pos; i++)
                    {
#if (SHELL_ECHO > 0)
                        if (0 == shellContextHandle->state.noEcho)
                        {
                            (void)SHELL_Write(shellContextHandle, (char *)"\b", 1);
                        }
#endif
                    }
                    /* Do auto complete */
                    SHELL_AutoComplete(shellContextHandle);
                    /* Move position to end */
                    shellContextHandle->c_pos = shellContextHandle->l_pos = (uint16_t)strlen(shellContextHandle->line);
#endif
                    continue;
                }
                /* Handle backspace key */
                else if ((ch == KET_DEL) || ((char)ch == '\b'))
                {
                    uint8_t l_pos_sub =0;

                    if (shellContextHandle->l_pos > 0)
                    {
                        shellContextHandle->l_pos--;
                        l_pos_sub = 1;
                    }

                    if (shellContextHandle->c_pos > 0)
                    {
                        shellContextHandle->c_pos--;
                    }
                    else
                    {
                        if (l_pos_sub > 0)
                        {
                            shellContextHandle->l_pos ++;
                        }
                        continue;
                    }

                    if (shellContextHandle->l_pos > shellContextHandle->c_pos)
                    {
                        (void)memmove(&shellContextHandle->line[shellContextHandle->c_pos],
                                      &shellContextHandle->line[shellContextHandle->c_pos + 1U],
                                      shellContextHandle->l_pos - shellContextHandle->c_pos);
                        shellContextHandle->line[shellContextHandle->l_pos] = 0U;
#if (SHELL_ECHO > 0)
                        if (0 == shellContextHandle->state.noEcho)
                        {
                            (void)SHELL_Write(shellContextHandle, (char *)"\b", 1);
                            (void)SHELL_Write(shellContextHandle, &shellContextHandle->line[shellContextHandle->c_pos],
                                              strlen(&shellContextHandle->line[shellContextHandle->c_pos]));
                            (void)SHELL_Write(shellContextHandle, (char *)"  \b", 3);

                            /* Reset position */
                            int i;
                            for (i = shellContextHandle->c_pos; i <= shellContextHandle->l_pos; i++)
                            {
                                (void)SHELL_Write(shellContextHandle, (char *)"\b", 1);
                            }
                        }
#endif
                    }
                    else /* Normal backspace operation */
                    {
#if (SHELL_ECHO > 0)
                        if (0 == shellContextHandle->state.noEcho)
                        {
                            (void)SHELL_Write(shellContextHandle, (char *)"\b \b", 3);
                        }
#endif
                        shellContextHandle->line[shellContextHandle->l_pos] = 0U;
                    }
                    continue;
                }
                else
                {
                }

                /* Input too long */
                if (shellContextHandle->l_pos >= (SHELL_BUFFER_SIZE - 1U))
                {
                    shellContextHandle->l_pos = 0;
                }

                /* Handle end of line, break */
                if (((char)ch == '\r') || ((char)ch == '\n'))
                {
                    static char endoflinechar = 0U;

                    if (((uint8_t)endoflinechar != 0U) && ((uint8_t)endoflinechar != ch))
                    {
                        continue;
                    }
                    else
                    {
                        endoflinechar = (char)ch;
                        (void)SHELL_Write(shellContextHandle, (char *)"\r\n", 2);
                        /* If command line is or start with NULL, will start a new transfer */
                        if (0U == strlen(shellContextHandle->line))
                        {
                            /* Reset all params */
                            shellContextHandle->c_pos = shellContextHandle->l_pos = 0;
                            shellContextHandle->hist_current                      = 0;
                            (void)SHELL_Write(shellContextHandle, shellContextHandle->prompt,
                                              strlen(shellContextHandle->prompt));
                            (void)memset(shellContextHandle->line, 0, sizeof(shellContextHandle->line));
                            continue;
                        }
                        SHELL_ProcessCommand(shellContextHandle, shellContextHandle->line);
                        /* Reset all params */
                        shellContextHandle->c_pos = shellContextHandle->l_pos = 0;
                        shellContextHandle->hist_current                      = 0;
                        (void)SHELL_Write(shellContextHandle, shellContextHandle->prompt,
                                          strlen(shellContextHandle->prompt));
                        memset(shellContextHandle->line, 0, sizeof(shellContextHandle->line));
                        continue;
                    }
                }

