solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/edgefast_bluetooth/source/shell/fsl_shell.c
                /* Normal character */
                if (shellContextHandle->c_pos < shellContextHandle->l_pos)
                {
                    (void)memmove(&shellContextHandle->line[shellContextHandle->c_pos + 1U],
                                  &shellContextHandle->line[shellContextHandle->c_pos],
                                  shellContextHandle->l_pos - shellContextHandle->c_pos);
                    shellContextHandle->line[shellContextHandle->c_pos] = (char)ch;
#if (SHELL_ECHO > 0)
                    if (0 == shellContextHandle->state.noEcho)
                    {
                        (void)SHELL_Write(shellContextHandle, &shellContextHandle->line[shellContextHandle->c_pos],
                                          strlen(&shellContextHandle->line[shellContextHandle->c_pos]));
                        /* Move the cursor to new position */
                        int i;
                        for (i = shellContextHandle->c_pos; i < shellContextHandle->l_pos; i++)
                        {
                            (void)SHELL_Write(shellContextHandle, (char *)"\b", 1);
                        }
                    }
#endif
                }
                else
                {
                    shellContextHandle->line[shellContextHandle->l_pos] = (char)ch;
#if (SHELL_ECHO > 0)
                    if (0 == shellContextHandle->state.noEcho)
                    {
                        (void)SHELL_Write(shellContextHandle, &shellContextHandle->line[shellContextHandle->l_pos], 1);
                    }
#endif
                }

                ch = 0;
                shellContextHandle->l_pos++;
                shellContextHandle->c_pos++;
            } while (0 == shellContextHandle->state.exit);
        }
#if (defined(SHELL_NON_BLOCKING_MODE) && (SHELL_NON_BLOCKING_MODE > 0U))

#if defined(OSA_USED)

#if (defined(SHELL_USE_COMMON_TASK) && (SHELL_USE_COMMON_TASK > 0U))
#else
            }
        } while (gUseRtos_c);
#endif

#endif

#endif
    }
}

#if (defined(SHELL_ADVANCE) && (SHELL_ADVANCE > 0))
static void SHELL_PrintPrefixBlank(shell_context_handle_t *shellContextHandle, char *c, uint32_t count)
{
    uint32_t i;

    for (i = 0;i < count;i++)
    {
        (void)SHELL_Write(shellContextHandle, c, strlen(c));
    }
}
#endif /* SHELL_ADVANCE */

static shell_status_t SHELL_PrintCmdHelp(shell_context_handle_t *shellContextHandle, shell_command_t *cmd, uint32_t level)
{
#if (defined(SHELL_ADVANCE) && (SHELL_ADVANCE > 0))
    uint32_t i = 0;
    shell_command_t *cmdP;
#endif /* SHELL_ADVANCE */

    if (NULL == cmd)
    {
        return kStatus_SHELL_Success;
    }

    if ((cmd->pcHelpString != NULL) && (bool)strlen(cmd->pcHelpString))
    {
#if (defined(SHELL_ADVANCE) && (SHELL_ADVANCE > 0))
        SHELL_PrintPrefixBlank(shellContextHandle, (char *)"    ", level);
        SHELL_Write(shellContextHandle, (char *)"+---", 4);
#endif /* SHELL_ADVANCE */
        (void)SHELL_Write(shellContextHandle, cmd->pcHelpString, strlen(cmd->pcHelpString));
    }

#if (defined(SHELL_ADVANCE) && (SHELL_ADVANCE > 0))
    if (NULL != cmd->commandList)
    {
        while (NULL != cmd->commandList[i])
        {
            cmdP = cmd->commandList[i];
            (void)SHELL_PrintCmdHelp(shellContextHandle, cmdP, level + 1);
            i++;
        }
    }
#endif /* SHELL_ADVANCE */

    return kStatus_SHELL_Success;
}

static shell_status_t SHELL_PrintAllCmdHelp(shell_context_handle_t *shellContextHandle)
{
    shell_command_t *shellCommandContextHandle;
    list_element_handle_t p = LIST_GetHead(&shellContextHandle->commandContextListHead);

    SHELL_Printf(shellContextHandle, "\r\n");
    while (p != NULL)
    {
        shellCommandContextHandle = SHEEL_COMMAND_POINTER(p);

        (void)SHELL_PrintCmdHelp(shellContextHandle, shellCommandContextHandle, 0);

        p = LIST_GetNext(p);
    }
#if 0
    (void)SHELL_Write(shellContextHandle, shellContextHandle->prompt, strlen(shellContextHandle->prompt));
#endif
    return kStatus_SHELL_Success;
}

#if (defined(SHELL_ADVANCE) && (SHELL_ADVANCE > 0))
static shell_status_t SHELL_FindCommand(shell_context_handle_t *shellContextHandle, shell_command_t *cmd, char *cmdLine, shell_command_t **cmdOutput)
{
    shell_command_t *cmdP;
    shell_command_t *cmdBest = NULL;
    shell_command_t *cmdTemp;
    shell_status_t status;
    uint32_t i = 0;

    if ((NULL == cmd) || (NULL == cmdOutput))
    {
        return kStatus_SHELL_Error;
    }

    if (0 != SHELL_StringCompare(cmd->pcCommand, cmdLine, (uint32_t)strlen(cmd->pcCommand)))
    {
        return kStatus_SHELL_Error;
    }

    if (strlen(cmdLine) > strlen(cmd->pcCommand))
    {
        if ((cmdLine[strlen(cmd->pcCommand)] != SHELL_COMMAND_CONNECTOR) && (cmdLine[strlen(cmd->pcCommand)] != ' '))
        {
            return kStatus_SHELL_Error;
        }
    }

    if ((NULL != cmd->commandList) && (strlen(cmdLine) > ((uint32_t)strlen(cmd->pcCommand))))
    {
        if (SHELL_COMMAND_CONNECTOR != cmdLine[((uint32_t)strlen(cmd->pcCommand))])
        {
            return kStatus_SHELL_Error;
        }

        while (NULL != cmd->commandList[i])
        {
            cmdP = cmd->commandList[i];
            status = SHELL_FindCommand(shellContextHandle, cmdP, &cmdLine[((uint32_t)strlen(cmd->pcCommand)) + 1], &cmdTemp);

            if (kStatus_SHELL_Success == status)
            {
                if (NULL == cmdBest)
                {
                    cmdBest = cmdTemp;
                }
                else
                {
                    uint32_t deltaBest = 0xFF;
                    uint32_t deltaTemp = 0xFF;

                    memset(s_cmdLineBuffer, 0U, sizeof(s_cmdLineBuffer));
                    if (kStatus_SHELL_Success == SHELL_PrintCommandPath(shellContextHandle, cmdBest, s_cmdLineBuffer, sizeof(s_cmdLineBuffer)))
                    {
                        if (strlen(cmdLine) > strlen(s_cmdLineBuffer))
                        {
                            deltaBest = strlen(cmdLine) - strlen(s_cmdLineBuffer);
                        }
                        else
                        {
                            deltaBest = strlen(s_cmdLineBuffer) - strlen(cmdLine);
                        }
                    }

                    memset(s_cmdLineBuffer, 0U, sizeof(s_cmdLineBuffer));
                    if (kStatus_SHELL_Success == SHELL_PrintCommandPath(shellContextHandle, cmdTemp, s_cmdLineBuffer, sizeof(s_cmdLineBuffer)))
                    {
                        if (strlen(cmdLine) > strlen(s_cmdLineBuffer))
                        {
                            deltaTemp = strlen(cmdLine) - strlen(s_cmdLineBuffer);
                        }
                        else
                        {
                            deltaTemp = strlen(s_cmdLineBuffer) - strlen(cmdLine);
                        }
                    }

