solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/edgefast_bluetooth/source/shell/fsl_shell.c
                    if (deltaTemp < deltaBest)
                    {
                        cmdBest = cmdTemp;
                    }
                }
            }
            i++;
        }
        if (NULL != cmdBest)
        {
            *cmdOutput = cmdBest;
            return kStatus_SHELL_Success;
        }
    }
    else
    {
        *cmdOutput = cmd;

        return kStatus_SHELL_Success;
    }

    return kStatus_SHELL_Error;
}
#endif /* SHELL_ADVANCE */

static shell_status_t SHELL_HelpCommand(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    (void)argc;
    (void)argv;

    return SHELL_PrintAllCmdHelp((shell_context_handle_t *)shellHandle);
}

static shell_status_t SHELL_ExitCommand(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    shell_context_handle_t *shellContextHandle = (shell_context_handle_t *)shellHandle;
    /* Skip warning */
    (void)SHELL_Write(shellContextHandle, (char *)"\r\nSHELL exited\r\n", strlen("\r\nSHELL exited\r\n"));
    shellContextHandle->state.exit = (uint8_t) 1;
    return kStatus_SHELL_Success;
}

#if (defined(SHELL_ADVANCE) && (SHELL_ADVANCE > 0))
#if (SHELL_ECHO > 0)
static shell_status_t SHELL_EchoCommand(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    shell_context_handle_t *shellContextHandle = (shell_context_handle_t *)shellHandle;
    /* Skip warning */
    (void)SHELL_Printf(shellContextHandle, "\r\nSHELL echo %s\r\n", ('0' == argv[1][0]) ? "disabled" : "enabled");
    shellContextHandle->state.noEcho = (uint8_t) (('0' == argv[1][0]) ? 1 : 0);
    return kStatus_SHELL_Success;
}
#endif
#endif

static void SHELL_ProcessCommand(shell_context_handle_t *shellContextHandle, const char *cmd)
{
    shell_command_t *tmpCommand = NULL;
    const char *tmpCommandString;
    int32_t argc;
    char *argv[SHELL_MAX_ARGS];
    list_element_handle_t p;
    uint8_t flag = 1;
    uint16_t tmpCommandLen;
    uint16_t tmpLen;
    uint16_t i = 0;

    tmpLen = (uint16_t)strlen(cmd);
    argc   = SHELL_ParseLine(cmd, tmpLen, argv);

    if ((argc > 0))
    {
        p = LIST_GetHead(&shellContextHandle->commandContextListHead);
        while (p != NULL)
        {
            tmpCommand       = SHEEL_COMMAND_POINTER(p);
            tmpCommandString = tmpCommand->pcCommand;
            tmpCommandLen    = (uint16_t)strlen(tmpCommandString);
            /* Compare with space or end of string */
            if ((cmd[tmpCommandLen] == ' ') || (cmd[tmpCommandLen] == (char)0x00)
#if (defined(SHELL_ADVANCE) && (SHELL_ADVANCE > 0))
                || (SHELL_COMMAND_CONNECTOR == cmd[tmpCommandLen])
#endif /* SHELL_ADVANCE */
                  )
            {
                if (SHELL_StringCompare(tmpCommandString, argv[0], (uint32_t)tmpCommandLen) == 0)
                {
#if (defined(SHELL_ADVANCE) && (SHELL_ADVANCE > 0))
                    if (kStatus_SHELL_Success != SHELL_FindCommand(shellContextHandle, tmpCommand, argv[0], &tmpCommand))
                    {
                        p = LIST_GetNext(p);
                        continue;
                    }
                    /* support commands with optional number of parameters */
                    if (tmpCommand->parameter.cExpectedNumberOfParameters >=
                        (uint32_t)(((uint32_t)SHELL_IGNORE_PARAMETER_COUNT) | (((uint32_t)SHELL_IGNORE_PARAMETER_COUNT) << 16)))
                    {
                        flag = 0;
                    }
                    else if (((tmpCommand->parameter.range.min + 1) <= argc) && ((tmpCommand->parameter.range.max + 1) >= argc))
                    {
                        flag = 0;
                    }
                    else
#else
                    /* support commands with optional number of parameters */
                    if (tmpCommand->cExpectedNumberOfParameters == (uint8_t)SHELL_IGNORE_PARAMETER_COUNT)
                    {
                        flag = 0;
                    }
                    else if ((tmpCommand->cExpectedNumberOfParameters == 0U) && (argc == 1))
                    {
                        flag = 0;
                    }
                    else if (tmpCommand->cExpectedNumberOfParameters > 0U)
                    {
                        if ((argc - 1U) == tmpCommand->cExpectedNumberOfParameters)
                        {
                            flag = 0;
                        }
                    }
                    else
#endif /* SHELL_ADVANCE */
                    {
                        flag = 1;
                    }
                    break;
                }
            }
            p = LIST_GetNext(p);
        }
        if (NULL == p)
        {
            tmpCommand = NULL;
        }
    }

    if ((tmpCommand != NULL) && (flag == 1U))
    {
        (void)SHELL_Write(
            shellContextHandle,
            (char *)"\r\nIncorrect command parameter(s).  Enter \"help\" to view a list of available commands.\r\n\r\n",
            strlen(
                "\r\nIncorrect command parameter(s).  Enter \"help\" to view a list of available commands.\r\n\r\n"));
        tmpCommand = NULL;
    }
    else if (tmpCommand != NULL)
    {
        shell_status_t ret;
        tmpLen = (uint16_t)strlen(cmd);
        /* Compare with last command. Push back to history buffer if different */
        if (tmpLen != (uint16_t)SHELL_StringCompare(cmd, shellContextHandle->hist_buf[0], (int32_t)strlen(cmd)))
        {
            for (i = SHELL_HISTORY_COUNT - 1U; i > 0U; i--)
            {
                (void)memset(shellContextHandle->hist_buf[i], '\0', SHELL_BUFFER_SIZE);
                tmpLen = (uint16_t)strlen(shellContextHandle->hist_buf[i - 1U]);
                (void)memcpy(shellContextHandle->hist_buf[i], shellContextHandle->hist_buf[i - 1U], tmpLen);
            }
            (void)memset(shellContextHandle->hist_buf[0], '\0', SHELL_BUFFER_SIZE);
            tmpLen = (uint16_t)strlen(cmd);
            (void)memcpy(shellContextHandle->hist_buf[0], cmd, tmpLen);
            if (shellContextHandle->hist_count < SHELL_HISTORY_COUNT)
            {
                shellContextHandle->hist_count++;
            }
        }
#if (defined(SHELL_ADVANCE) && (SHELL_ADVANCE > 0))
        memcpy(argv[0], tmpCommand->pcCommand, strlen(tmpCommand->pcCommand) + 1);
#endif /* SHELL_ADVANCE */
        if (NULL !=  tmpCommand->pFuncCallBack)
        {
            ret = tmpCommand->pFuncCallBack(shellContextHandle, argc, argv);
        }
        else
        {
            ret = kStatus_SHELL_PrintCmdHelp;
        }
        if (kStatus_SHELL_Success == ret)
        {
            /* Command executed successfully */
        }
        else
        {
            /* error is occurred */
#if (defined(SHELL_ADVANCE) && (SHELL_ADVANCE > 0))
            if (kStatus_SHELL_PrintCmdHelp == ret)
            {
                SHELL_PrintCmdHelp(shellContextHandle, tmpCommand, 0);
            }
            else if (kStatus_SHELL_PrintAllHelp == ret)
            {
                SHELL_PrintAllCmdHelp(shellContextHandle);
            }
            else
            {
                /* Other errors */
            }
            (void)SHELL_Printf(shellContextHandle, "Command executed failure\r\n");
#endif /* SHELL_ADVANCE */
        }
        tmpCommand = NULL;
    }
    else
    {
        (void)SHELL_Write(
            shellContextHandle,
            (char *)"\r\nCommand not recognized.  Enter 'help' to view a list of available commands.\r\n\r\n",
            strlen("\r\nCommand not recognized.  Enter 'help' to view a list of available commands.\r\n\r\n"));
        tmpCommand = NULL;
    }
}

