solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/edgefast_bluetooth/source/shell/fsl_shell.c
static void SHELL_GetHistoryCommand(shell_context_handle_t *shellContextHandle, uint16_t hist_pos)
{
    uint32_t i;
    uint32_t tmp;

    if (shellContextHandle->hist_buf[0][0] == '\0')
    {
        shellContextHandle->hist_current = 0;
        return;
    }

#if 0 /*hist_pos is passed from hist_current. And hist_current is only changed in case 'A'/'B',as hist_count is 3 \
         most, it can't be more than 3  */
    if (hist_pos >= SHELL_HISTORY_COUNT)
    {
        hist_pos = SHELL_HISTORY_COUNT - 1U;
    }
#endif

    tmp = strlen(shellContextHandle->line);
    /* Clear current if have */
    if (tmp > 0U)
    {
        (void)memset(shellContextHandle->line, '\0', tmp);
        for (i = 0; i < tmp; i++)
        {
            (void)SHELL_Write(shellContextHandle, (char *)"\b \b", 3);
        }
    }

    shellContextHandle->l_pos = (uint16_t)strlen(shellContextHandle->hist_buf[hist_pos]);
    shellContextHandle->c_pos = shellContextHandle->l_pos;
    (void)memcpy(shellContextHandle->line, shellContextHandle->hist_buf[hist_pos], shellContextHandle->l_pos);
    (void)SHELL_Write(shellContextHandle, shellContextHandle->hist_buf[hist_pos],
                      strlen(shellContextHandle->hist_buf[hist_pos]));
}

#if (defined(SHELL_ADVANCE) && (SHELL_ADVANCE > 0))

static shell_status_t SHELL_PrintCommandPathRecursion(shell_context_handle_t *shellContextHandle, shell_command_t *cmdStart, shell_command_t *cmdTarget, char *path, uint32_t pathLength)
{
    shell_command_t *cmdP;
    uint32_t i = 0;

    if ((NULL == cmdStart) || (NULL == cmdTarget) ||(NULL == path))
    {
        return kStatus_SHELL_Error;
    }

    if ((NULL != cmdStart->commandList))
    {
        while (NULL != cmdStart->commandList[i])
        {
            cmdP = cmdStart->commandList[i];
            if (cmdP == cmdTarget)
            {
                memset(path, 0, pathLength);
                memcpy(path, cmdP->pcCommand, strlen(cmdP->pcCommand));
                return kStatus_SHELL_Success;
            }
            else
            {
                if (kStatus_SHELL_Success == SHELL_PrintCommandPathRecursion(shellContextHandle, cmdP, cmdTarget, path, pathLength))
                {
                    uint32_t length = strlen(path);
                    if((length + strlen(cmdP->pcCommand)) < pathLength)
                    {
                        for (uint32_t index = 0;index < length;index++)
                        {
                            path[(length - index) + strlen(cmdP->pcCommand)] = path[(length - index) - 1];
                        }
                        memcpy(path, cmdP->pcCommand, strlen(cmdP->pcCommand));
                        path[strlen(cmdP->pcCommand)]     = SHELL_COMMAND_CONNECTOR;
                        path[pathLength-1] = '\0';
                        return kStatus_SHELL_Success;
                    }

                    return kStatus_SHELL_Error;
                }
            }
            i++;
        }
    }
    return kStatus_SHELL_Error;
}

static shell_status_t SHELL_PrintCommandPath(shell_context_handle_t *shellContextHandle, shell_command_t *cmd, char *path, uint32_t pathLength)
{
    list_element_handle_t cmdP;
    shell_command_t *cmdTemp = NULL;

        /* Do auto complete */
    cmdP = LIST_GetHead(&shellContextHandle->commandContextListHead);
    while (cmdP != NULL)
    {
        cmdTemp = SHEEL_COMMAND_POINTER(cmdP);
        if (kStatus_SHELL_Success == SHELL_PrintCommandPathRecursion(shellContextHandle, cmdTemp, cmd, path, pathLength))
        {
            uint32_t length = strlen(path);
            if((length + strlen(cmdTemp->pcCommand)) < pathLength)
            {
                for (uint32_t index = 0;index < length;index++)
                {
                    path[(length - index) + strlen(cmdTemp->pcCommand)] = path[(length - index) - 1];
                }
                memcpy(path, cmdTemp->pcCommand, strlen(cmdTemp->pcCommand));
                path[strlen(cmdTemp->pcCommand)]     = SHELL_COMMAND_CONNECTOR;
                path[pathLength-1] = '\0';
                return kStatus_SHELL_Success;
            }

            return kStatus_SHELL_Error;
        }
        if (cmdTemp == cmd)
        {
            memset(path, 0, pathLength);
            memcpy(path, cmdTemp->pcCommand, strlen(cmdTemp->pcCommand));
            return kStatus_SHELL_Success;
        }
        cmdP = LIST_GetNext(cmdP);
    }

    return kStatus_SHELL_Error;
}

static shell_status_t SHELL_AutoCompleteCommand(shell_context_handle_t *shellContextHandle, shell_command_t *cmd, char *cmdLine, shell_command_t **cmdOut)
{
    shell_command_t *cmdP;
    shell_command_t *cmdTemp = NULL;
    uint32_t i = 0;

    if (NULL == cmd)
    {
        return kStatus_SHELL_Error;
    }

    if (strlen(cmdLine) <= strlen(cmd->pcCommand))
    {
        if (0 != SHELL_StringCompare(cmdLine, cmd->pcCommand, (uint32_t)strlen(cmdLine)))
        {
            return kStatus_SHELL_Error;
        }
        else
        {
            memset(s_cmdLineBuffer, 0U, sizeof(s_cmdLineBuffer));
            /* Show possible matches */
            if (kStatus_SHELL_Success == SHELL_PrintCommandPath(shellContextHandle, cmd, s_cmdLineBuffer, sizeof(s_cmdLineBuffer)))
            {
                SHELL_Printf(shellContextHandle, "%s\r\n", (char *)s_cmdLineBuffer);
            }
            *cmdOut = cmd;
            return kStatus_SHELL_Success;
        }
    }

    if (0 != SHELL_StringCompare(cmd->pcCommand, cmdLine, (uint32_t)strlen(cmd->pcCommand)))
    {
        return kStatus_SHELL_Error;
    }

    if ((NULL != cmd->commandList) && (strlen(cmdLine) > ((uint32_t)strlen(cmd->pcCommand))))
    {
        if (SHELL_COMMAND_CONNECTOR != cmdLine[((uint32_t)strlen(cmd->pcCommand))])
        {
            return kStatus_SHELL_Error;
        }

        while (NULL != cmd->commandList[i])
        {
            cmdP = cmd->commandList[i];
            (void)SHELL_AutoCompleteCommand(shellContextHandle, cmdP, &cmdLine[((uint32_t)strlen(cmd->pcCommand)) + 1], &cmdTemp);
            if (NULL != cmdTemp)
            {
                *cmdOut = cmdTemp;
            }
            i++;
        }
    }

    if (NULL != *cmdOut)
    {
        return kStatus_SHELL_Success;
    }

    return kStatus_SHELL_Error;
}
#endif /* SHELL_ADVANCE */

static void SHELL_AutoComplete(shell_context_handle_t *shellContextHandle)
{
    int32_t minLen;
    list_element_handle_t p;
    shell_command_t *tmpCommand = NULL;
    const char *namePtr;
    const char *cmdName;

